package task;


//Создать API для работы с сотрудником. Мы должны иметь возможность добавить нового сотрудника, изменить зарплату сотруднику, изменить его паспортные данные, получить сотрудника по id.
//Response карточка сотрудника: name, surname, passportNumber, passportDate, salary.
//
//        Требования:
//        - Создайте необходимые таблицы для работы с сотрудником, вы сами определяете необходимый набор таблиц и полей в них.
//        - Реализуйте API эндпоинты для добавления нового сотрудника, изменения зарплаты и паспортных данных сотрудника, а также получения сотрудника по id.
//        Подсказка: рассмотрите типичные RESTful API для реализации каждой из этих функций.
//        - Ответ API должен содержать данные о сотруднике со следующим набором полей name, surname, passportNumber, passportDate, salary.
//
//Примечание: Предполагается, что изменение зарплаты и изменение паспортных данных будут производиться разными отделами, и может потребовать разделение ответственности в архитектуре приложения
public class Test {
}
